app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "latitude", "longitude", "radius", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "hello"], ["latitude", "10.1"], ["longitude", "-1.39"], ["radius", 4], ["created_at", "2015-01-31 14:11:11.701232"], ["updated_at", "2015-01-31 14:11:11.701232"]]
---
  def create
    @message = Message.new(message_params)

    if @message.save